app/Controllers/ProductController.php

    public function detalhes($id_produto)
    {
        $produtoModel = new \App\Models\ProdutoIndividualModel();

        $produto = $produtoModel->find($id_produto);
---
SELECT *
FROM `produtos`
WHERE `produtos`.`id_produto` = '13'